In [1]:
import sqlite_create

BBDD creada y datos insertados correctamente al archivo resultado_Miss_Marple.db.

In [2]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('./resultado_Miss_Marple.db')

query = "SELECT name FROM sqlite_master WHERE type='table';"
tablas = pd.read_sql(query, conn)

for nombre_tabla in tablas['name']:
    query = f"SELECT * FROM {nombre_tabla}"
    globals()[nombre_tabla] = pd.read_sql(query, conn)

In [3]:
proveedor

   idProveedor       nombre           direccion    ciudad    provincia
0            1  Proveedor A  Calle Ficticia 123  Ciudad A  Provincia A
1            2  Proveedor B   Avenida Falsa 456  Ciudad B  Provincia B

In [4]:
categoria

   idCategoria       nombre
0            1  Electrónica
1            2   Mobiliario

In [5]:
pieza

   idPieza     nombre   color  precio
0        1  Televisor   Negro  299.99
1        2      Silla  Madera   89.99

In [6]:
pieza_categoria

   idPieza  idCategoria
0        1            1
1        1            2

In [7]:
suministro

   idProveedor  idPieza       fecha  cantidad
0            1        1  2024-12-01        50
1            2        2  2024-12-02        30